about
access
accordion
achievements
action
actions
active
adapter
admin
alert
allow
anchor
animate
api
approach
approval
approve
approved
archive
area
array
aspect
assert
asset
assets
authenticated
authority
available
avatar
badge
bar
based
belongs
body
border
brains
brand
breadcrumb
browser
bucket
build
button
can
cancel
capabilities
capability
caption
card
carousel
categories
category
cell
chart
check
checkbox
checklist
class
classes
classification
clean
clear
client
clone
close
clsx
cmdk
cms
collapsible
color
command
commands
common
compiler
component
config
configuration
confirmation
console
consolidation
constants
contact
container
content
context
control
cookie
cookies
core
create
credential
credentials
css
cta
current
dashboard
data
date
default
delete
dependencies
description
design
detail
details
dev
dialog
display
dom
down
draft
drawer
dropdown
duplicate
editable
editing
editor
ellipsis
email
embla
emit
empty
ensure
entries
entry
env
event
exclude
existing
experience
experiences
expired
extensions
fallback
family
featured
field
fields
figma
file
filter
fix
flag
flat
flight
flow
font
footer
for
form
format
foundation
from
function
generate
get
grant
grants
grotesk
group
guide
guidelines
handle
head
header
helper
helpers
hex
hide
hook
hover
html
ian
icon
icons
ids
image
importing
include
incremental
index
indicator
initial
input
inset
intensity
interop
isolated
isolation
item
items
jet
json
jsx
key
lab
label
labs
layout
legend
level
levels
lib
library
limit
line
lines
link
links
list
local
log
login
logs
lucide
machine
main
make
manage
manager
mapping
markdown
max
maybe
media
member
members
menu
menubar
merge
message
metadata
migration
mjs
mobile
mode
modes
module
modules
mono
multi
mutation
name
navigation
next
node
normalize
notification
notifications
nullable
object
one
only
option
optional
options
order
otp
overlay
owner
ownership
package
page
pagination
panel
panels
parameters
params
parse
partial
path
paths
pattern
payload
permissions
personal
photos
picker
placeholder
plugin
plugins
pnpm
point
policies
popover
portal
portfolio
portfolios
post
postcss
pre
preset
presets
prevention
preview
previous
private
process
profile
progress
project
projects
props
protection
provider
public
queries
query
queue
quick
radio
radix
rail
ratio
raw
reached
react
read
received
recharts
record
reference
reject
rejected
rejection
reorder
request
requestable
requests
require
resend
reset
resizable
resolution
resolve
response
responsive
restore
restricted
result
resume
resumes
revalidate
revoke
revoked
rls
role
root
route
row
rows
rpc
rule
safety
sanitize
save
scoped
scoping
scripts
scroll
section
sections
seed
select
selector
send
separation
separator
server
service
session
set
settings
shadcn
sheet
shell
shortcut
show
side
sidebar
signed
single
site
skeleton
skill
skills
skip
slider
slot
slug
slugify
soft
sonner
sorted
source
space
stable
stack
start
stat
state
status
step
steps
storage
story
strict
string
strings
style
sub
suggestions
summary
supabase
supported
switch
system
table
tables
tabs
tailwind
tailwindcss
target
task
template
terminal
text
textarea
theme
themes
three
time
title
toaster
toggle
token
tokens
tone
tooltip
top
trigger
tsconfig
tsx
type
types
typescript
uniqueness
unsplash
update
updated
upload
url
use
user
utilities
utils
uuid
valid
validate
validation
value
values
variance
variants
vaul
version
view
viewer
viewport
violet
visibility
warn
website
with
workflow
workspace
wrap
writeup
writeups